#Дан список целых чисел. Требуется вычислить, сколько раз встречается некоторое число X в этом списке.
#Пользователь вводит число X с клавиатуры. Список можно считать заданным.
#Если такого числа в списке нет - вывести -1.
elements = [10, 5, 7, 3, 3, 0, 5, 7, 2, 8]
print('enter X: ')
x = int(input())
if x in elements:
    print(elements.count(x))
else:
    print('Х нет в нашем списке!')

